In [1]:
from utils.io import gen_id_dated, gdf_viewer, gdf_geom, gdf_merger, na_col_drop, na_line_drop
import re, os
import numpy as np
import geopandas as gpd
import pandas as pd
from shapely.geometry import Point
import datetime as dtm
import matplotlib.pyplot as plt
from definitions import ROOT_DIR

In [2]:
t1 = pd.DataFrame({'ID':['id1','id2','id3','id4','id5','id6','id7','id8'],'Name':['A','B','C','D','E','F','G','H'],
                   'Value':[1,2,3,4,np.nan,5,np.nan,7], 'X': [1,4,12,8,7,11,8,13], 'Y': [7,4,2,18,14,9,11,5]})
t2 = pd.DataFrame({'ID':['id1','id2','id3','id4','id5','id6','id7','id8'],'Name':['A','B','D','C','E','F','G','h'],
                   'Value':[1,3,2,4,np.nan,np.nan,6,7],'X': [np.nan,4,12,8,7,11,8,13], 'Y': [np.nan,4,2,18,14,9,1,5]})

In [3]:
t1.merge(t2, on='ID', how='outer')

    ID Name_x  Value_x  X_x  Y_x Name_y  Value_y   X_y   Y_y
0  id1      A      1.0    1    7      A      1.0   NaN   NaN
1  id2      B      2.0    4    4      B      3.0   4.0   4.0
2  id3      C      3.0   12    2      D      2.0  12.0   2.0
3  id4      D      4.0    8   18      C      4.0   8.0  18.0
4  id5      E      NaN    7   14      E      NaN   7.0  14.0
5  id6      F      5.0   11    9      F      NaN  11.0   9.0
6  id7      G      NaN    8   11      G      6.0   8.0   1.0
7  id8      H      7.0   13    5      h      7.0  13.0   5.0

In [4]:
gdf_merger(t1, t2, col='ID', how='outer', col_non_na=0, dist_max=1.)[0]

['ID']
distinct objects to add:
 {0: {'ID': 'id7', 'Value': nan, 'Y': 11, 'Name': 'G', 'X': 8}, 1: {'ID': 'id7', 'Value': 6.0, 'Y': 1.0, 'Name': 'G', 'X': 8.0}}
1 NaN lines dropped
Ambiguous values in both columns compared, change it manually !
Columns ['Value_x', 'Value_y'] must be dropped manually !

/home/su530201/.local/share/virtualenvs/GSDMA-tJb-HgI6/lib/python3.8/site-packages/pandas/core/frame.py:4305: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

    ID     X     Y    Value Name
0  id1   1.0   7.0      1.0    A
1  id2   4.0   4.0  99999.0    B
2  id3  12.0   2.0  99999.0  NaN
3  id4   8.0  18.0      4.0  NaN
4  id5   7.0  14.0      NaN    E
5  id6  11.0   9.0      5.0    F
6  id8  13.0   5.0      7.0    H

In [5]:
gdf_merger(t1,t2, col='ID', how='outer', col_non_na=0, dist_max=1)[1]

['ID']
distinct objects to add:
 {0: {'ID': 'id7', 'Value': nan, 'Y': 11, 'Name': 'G', 'X': 8}, 1: {'ID': 'id7', 'Value': 6.0, 'Y': 1.0, 'Name': 'G', 'X': 8.0}}
1 NaN lines dropped
Ambiguous values in both columns compared, change it manually !
Columns ['Value_x', 'Value_y'] must be dropped manually !

/home/su530201/.local/share/virtualenvs/GSDMA-tJb-HgI6/lib/python3.8/site-packages/pandas/core/frame.py:4305: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

    ID  Value_x  Value_y  Source_index
0  id2      2.0      3.0             1
1  id3      3.0      2.0             2